<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"1d4cddf9c4749e11868a01bca2fe2ff484e08127dc2b6dd24214b404d72563ad","plan_job_ref":"Job Plan Airflow DAGs #170 at https://github.com/cal-itp/data-infra/actions/runs/16033970974","plan_out_hash":"492739eb8067c964865e0ffa417a8c858529bf010fbe851e4ddc309dcc507f84","plan_hash":"dc37bb4c3586aea9443e491ce4004b5cb725157a2a60a1340e943cbf2518c1d9","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 9 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/deploy_dbt_docs/METADATA.yml"] will be destroyed
  # (because key ["dags/deploy_dbt_docs/METADATA.yml"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "472qxg==" -> null
-       detect_md5hash      = "ufLNuwrtZMShF1UroHMWXw==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416672429160 -> null
-       id                  = "calitp-composer-dags/deploy_dbt_docs/METADATA.yml" -> null
-       md5hash             = "ufLNuwrtZMShF1UroHMWXw==" -> null
-       md5hexhash          = "b9f2cdbb0aed64c4a117552ba073165f" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/dags%2Fdeploy_dbt_docs%2FMETADATA.yml?generation=1751416672429160&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/deploy_dbt_docs/METADATA.yml" -> null
-       output_name         = "dags/deploy_dbt_docs/METADATA.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/dags%2Fdeploy_dbt_docs%2FMETADATA.yml" -> null
-       source              = "../../../../airflow/dags/deploy_dbt_docs/METADATA.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/deploy_dbt_docs/README.md"] will be destroyed
  # (because key ["dags/deploy_dbt_docs/README.md"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "/YRi+w==" -> null
-       detect_md5hash      = "zyq5/eynFG5LYUq1xLgbVA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416670678955 -> null
-       id                  = "calitp-composer-dags/deploy_dbt_docs/README.md" -> null
-       md5hash             = "zyq5/eynFG5LYUq1xLgbVA==" -> null
-       md5hexhash          = "cf2ab9fdeca7146e4b614ab5c4b81b54" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/dags%2Fdeploy_dbt_docs%2FREADME.md?generation=1751416670678955&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/deploy_dbt_docs/README.md" -> null
-       output_name         = "dags/deploy_dbt_docs/README.md" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/dags%2Fdeploy_dbt_docs%2FREADME.md" -> null
-       source              = "../../../../airflow/dags/deploy_dbt_docs/README.md" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/deploy_dbt_docs/deploy_dbt_docs_site.yml"] will be destroyed
  # (because key ["dags/deploy_dbt_docs/deploy_dbt_docs_site.yml"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "ryGaTw==" -> null
-       detect_md5hash      = "shDUGtnHLdUw97Cl4kbMGg==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416673203130 -> null
-       id                  = "calitp-composer-dags/deploy_dbt_docs/deploy_dbt_docs_site.yml" -> null
-       md5hash             = "shDUGtnHLdUw97Cl4kbMGg==" -> null
-       md5hexhash          = "b210d41ad9c72dd530f7b0a5e246cc1a" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/dags%2Fdeploy_dbt_docs%2Fdeploy_dbt_docs_site.yml?generation=1751416673203130&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/deploy_dbt_docs/deploy_dbt_docs_site.yml" -> null
-       output_name         = "dags/deploy_dbt_docs/deploy_dbt_docs_site.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/dags%2Fdeploy_dbt_docs%2Fdeploy_dbt_docs_site.yml" -> null
-       source              = "../../../../airflow/dags/deploy_dbt_docs/deploy_dbt_docs_site.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/transform_warehouse/README.md"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "h7e/HA==" -> (known after apply)
!~      detect_md5hash      = "xpfoZukDvuBpLqj2cV1Ljw==" -> "different hash"
!~      generation          = 1751416673831464 -> (known after apply)
        id                  = "calitp-composer-dags/transform_warehouse/README.md"
!~      md5hash             = "xpfoZukDvuBpLqj2cV1Ljw==" -> (known after apply)
        name                = "dags/transform_warehouse/README.md"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "RVuQ0Q==" -> (known after apply)
!~      detect_md5hash      = "V3zm4Z8nZBZlzK0Hq5r5Lw==" -> "different hash"
!~      generation          = 1751416675246772 -> (known after apply)
        id                  = "calitp-composer-dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"
!~      md5hash             = "V3zm4Z8nZBZlzK0Hq5r5Lw==" -> (known after apply)
        name                = "dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/transform_warehouse_full_refresh/README.md"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "ffYrDQ==" -> (known after apply)
!~      detect_md5hash      = "ZQoAHElq7ft1ALqB3L+W+w==" -> "different hash"
!~      generation          = 1751416671361819 -> (known after apply)
        id                  = "calitp-composer-dags/transform_warehouse_full_refresh/README.md"
!~      md5hash             = "ZQoAHElq7ft1ALqB3L+W+w==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh/README.md"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "v7Zu1g==" -> (known after apply)
!~      detect_md5hash      = "PaIUXC14Tz4yuGmc/c22nw==" -> "different hash"
!~      generation          = 1751416671641646 -> (known after apply)
        id                  = "calitp-composer-dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"
!~      md5hash             = "PaIUXC14Tz4yuGmc/c22nw==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/transform_warehouse_full_refresh_sunday/README.md"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "hpmQwQ==" -> (known after apply)
!~      detect_md5hash      = "Q7MVkQanNnbGd//U/oQs6Q==" -> "different hash"
!~      generation          = 1751416674138172 -> (known after apply)
        id                  = "calitp-composer-dags/transform_warehouse_full_refresh_sunday/README.md"
!~      md5hash             = "Q7MVkQanNnbGd//U/oQs6Q==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/README.md"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "aGIbjw==" -> (known after apply)
!~      detect_md5hash      = "Wi3LmpTNpoclzt/cAjoVFQ==" -> "different hash"
!~      generation          = 1751416675339419 -> (known after apply)
        id                  = "calitp-composer-dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"
!~      md5hash             = "Wi3LmpTNpoclzt/cAjoVFQ==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "jV3law==" -> (known after apply)
!~      detect_md5hash      = "xMTiYx8sOp9LRGt4lKu5Dw==" -> "different hash"
!~      generation          = 1751416673580214 -> (known after apply)
        id                  = "calitp-composer-dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"
!~      md5hash             = "xMTiYx8sOp9LRGt4lKu5Dw==" -> (known after apply)
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "DnGEtg==" -> (known after apply)
!~      detect_md5hash      = "CaNvNGD3UolH/Lgif/hgcg==" -> "different hash"
!~      generation          = 1751474813781078 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "CaNvNGD3UolH/Lgif/hgcg==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "EAAQDg==" -> (known after apply)
!~      detect_md5hash      = "fT8Rf9TkiofZx/xDOyMq0A==" -> "different hash"
!~      generation          = 1751474815460715 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "fT8Rf9TkiofZx/xDOyMq0A==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-partial_parse will be created
+   resource "google_storage_bucket_object" "calitp-composer-partial_parse" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = "application/vnd.msgpack"
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/target/partial_parse.msgpack"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       storage_class  = (known after apply)
    }

Plan: 1 to add, 9 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #170](https://github.com/cal-itp/data-infra/actions/runs/16033970974)